HOCOOH/STM32-Authentication/Src/main.c
            // 更新密码
            for (int i = 0; i < MAX_PASSWORD_LEN; i++) {
                if (i < input_cursor)
                    pass_store[i] = pass_buf[i];
                else
                    pass_store[i] = 0;
            }
            SM3_Hash(pass_store, len(pass_store), (void*)pass_store_sm3);
            UpdatePasswdBackup();

            // 显示update
            uint8_t up_code[] = {0xCE, 0x7C};
            disp_str(up_code);
            printf("Password update to:\n");
            disp_in_serial(pass_store);
            
            /* 返回待机状态 */
            edit_mode = 0;
            UpdateState(STATE_WAIT);
        }
        /* 异常状态 */
        else {	// default 异常
//expcetion_handler:
            rand_delay();
            // =============
            uint8_t error_code[] = {0xB6, 0xB6, 0x9E, 0x9C, 0x9C, 0x7C, 0xB6};
            disp_str(error_code);
            // 需要延时!!!
            switch (state.errorCode) {
                case EXCEPT_UNVALIAD_STATE:
										printf("unvaliad state!\n");
                   // UpdateState(STATE_INIT);
                    break;
                case EXCEPT_TIMEOUT:
										printf("time out!\n");
                    //UpdateState(STATE_WAIT);
                    break;
                case EXCEPT_PASSLEN_LONG:
									printf("pass long!\n");
                   // UpdateState(STATE_WAIT);
                    break;
                case EXCEPT_PASSLEN_SHORT:
									printf("pass short!\n");
                   // UpdateState(STATE_WAIT);
                    break;
                default:
                    //UpdateState(STATE_INIT);
            }
						UpdateState(STATE_INIT);
        }
    }

}

u8 IsStateValid(u8 expectState) {
	//printf("current state:%d\n", state.currentState);
		//("last state:%d\n", state.lastState);
	if (state.currentState != expectState) {
		return 1;
	}

	// check pre state
	u8 check_pre_res = prev_state_table[state.currentState][state.lastState];
	
	if (check_pre_res == 0) {
		
		return 1;
	}

	return 0;	
}

void UpdateState(u8 nextState) {
    // TODO: check if next state is vaild
    state.lastState = state.currentState;
    state.currentState = nextState;
    // TODO: edit error code 
    if (nextState != STATE_EXCEPTION) {
        state.errorCode = 0;
    }

    // todo: 备份state
}

void UpdatePasswdBackup() {
  passwdCRC = 0;  
	// passwdCRC = HAL_CRC_Calculate(&hcrc, (u32*)pass_store_sm3, DIGEST_LEN / 4);
    for (int i = 0; i < N_BACKUP; i++) {
        for (int j = 0; j < MAX_PASSWORD_LEN; j++) {
            passwdBackupSM3[i][j] = pass_store_sm3[j];
        }
				passwdCRCBackup[i] = 0;
        //passwdCRCBackup[i] = HAL_CRC_Calculate(&hcrc, (u32*)passwdBackupSM3[i], DIGEST_LEN / 4);
    }
}

u8 IsPasswdValid() {
    u8 flag = 0;
    u8 validMask[N_BACKUP + 1] = {0};
    /* 首先校验密码备份 */
    u32 tmpCRC = 0;
    for (int i = 0; i < N_BACKUP; i++) {
			tmpCRC = 0;
        //tmpCRC = HAL_CRC_Calculate(&hcrc, (u32*)passwdBackupSM3[i], DIGEST_LEN / 4);
        if (tmpCRC == passwdCRCBackup[i]) {
            validMask[i] = 1;
        }
    }
		tmpCRC = 0;
    // tmpCRC = HAL_CRC_Calculate(&hcrc, (u32*)pass_store_sm3, DIGEST_LEN / 4);
    /* 检查密码哈希 */
    if (tmpCRC != passwdCRC) {
        flag = 1;
    }
    else {
        validMask[N_BACKUP] = 1;
        passwdCRCBackup[N_BACKUP] = tmpCRC;
        mymemcpy((void*)passwdCRCBackup[N_BACKUP], (void*)pass_store_sm3, DIGEST_LEN);
        for (int i = 0; i < N_BACKUP; i++) {
            if (validMask[i] && passwdCRCBackup[i] != passwdCRC) {
                flag = 1;
            }
        }
    }

    /* 若密码失效，尝试恢复 */
    if (flag) {
        flag = ResumePasswd(validMask);
    }

    return flag;
}

u8 ResumePasswd(u8* validMask) {
    u8 validCnt[N_BACKUP + 1] = {0};
    for (int i = 0; i <= N_BACKUP; i++) {
        for (int j = 0; j <= N_BACKUP; j++) {
            if (validMask[i] && validMask[j] && passwdCRCBackup[i] == passwdCRCBackup[j]) {
                validCnt[i]++;
            }
        }
    }
    
    /* 找到匹配数最多的密码 */
    u8 maxVal = 0, maxInex = 0;
    for (int i = 0; i <= N_BACKUP; i++) {
        if (maxVal < validCnt[i]) {
            maxVal = validCnt[i];
            maxInex = i;
        }
    }
    /* 没有两个相同的密码备份，炸了 */
    if (maxVal < 2) {
        return 1;
    }
    /* 恢复密码 */
    mymemcpy((void*)pass_store_sm3, (void*)passwdCRCBackup[maxInex], DIGEST_LEN);
    UpdatePasswdBackup();
    return 0;
}

void disp_str(uint8_t* code) {
    // printf("Enter function disp_str!\n\r");
    for (int i = 0;i < len(code); i++) {
        I2C_ZLG7290_Read(&hi2c1,0x71,0x10,Rx2_Buffer,8);
        Tx1_Buffer[0] = code[i];
        if(Rx2_Buffer[0] == 0) {
            I2C_ZLG7290_Write(&hi2c1,0x70,ZLG_WRITE_ADDRESS1,Tx1_Buffer,1);
        } else {									
            I2C_ZLG7290_Write(&hi2c1,0x70,ZLG_WRITE_ADDRESS2,Rx2_Buffer,BUFFER_SIZE2);
            I2C_ZLG7290_Write(&hi2c1,0x70,ZLG_WRITE_ADDRESS1,Tx1_Buffer,1);					
        }
    }
}

void mymemcpy(void* dest, const void* src, u32 len) {
    u8* destp = (u8*)dest;
    u8* srcp = (u8*)src;
    for (u32 i = 0; i < len; i++) {
        *destp++ = *srcp++;
    }
}

void disp_in_serial(uint8_t* arr) {
    // printf("Enter function disp_in_serial!\n\r");
    for (int i = 0; i < len(arr); i++) {
        printf("%x", arr[i]);
    }
    printf("\n\r\n\r");
}
uint8_t cmp(uint8_t* arr1, uint8_t* arr2, uint8_t len){
    printf("Enter function cmp!\n\r");
    for (int i = 0; i < len; i++)
        if (arr1[i] != arr2[i])
            return 1;
        // todo: 侧信道攻击
    return 0;
}

uint32_t len(uint8_t* arr){
    //printf("Enter function len!\n\r");
    uint32_t cnt = 0;
    uint32_t i = 0;
    while (arr[i] != 0) {
        cnt++;
        i++;
    }
    //printf("cnt:%d\n\r", cnt);
    return cnt;
    /*
    asm("nop");
    asm("nop");
    asm("jmp 0x8040000");
    */
}

void rand_delay() {
		unsigned int seed = 12345;
    srand(seed);
    u8  choice = rand() % 3;
    double seconds = delay_choices[choice];
    clock_t start = clock();
    clock_t lay = (clock_t)seconds * CLOCKS_PER_SEC;
    while ((clock()-start) < lay);
}

